"""
หยกต้องการขายกล้วย 1 หวี ราคา 29 บาท ให้เขียนโปรแกรมรับค่าเงินที่รับมาจากผู้ซื้อจากนั้นให้แสดงผลดังนี้ 
- ถ้าจำนวนเงินมากกว่าราคากล้วยให้แสดงจำนวนเงินทอน
- แต่ถ้าจำนวนเงินเท่ากับราคากล้วยให้แสดงข้อความว่า "จำนวนเงินพอดี ไม่มีเงินทอน"
- แต่ถ้า จำนวนเงินน้อยกว่าราคากล้วย ให้แสดงว่า จำนวนเงินไม่เพียงพอ
"""


def main():
    BANANA_PRICE = 29
    received_money = int(input())

    if received_money > BANANA_PRICE:
        print("เงินทอน: " + str(received_money - BANANA_PRICE) + " บาท")
    elif received_money == BANANA_PRICE:
        print("จำนวนเงินพอดี ไม่มีเงินทอน")
    elif received_money < BANANA_PRICE:
        print("จำนวนเงินไม่เพียงพอ")


main()
